In [1]:
#Sustituir **** por la contrase√±a propia de SQL 
%load_ext sql
%config SqlMagic.autocommit = False
%sql mysql+pymysql://root:****@localhost/publications

'Connected: root@publications'

## Challenge 1

### Step 1

In [2]:
%%sql step1 <<

CREATE TEMPORARY TABLE IF NOT EXISTS STEP_1(
SELECT 
	t.title_id "TITLE_ID",
	a.au_id "AUTHOR_ID", 
    a.au_lname "LAST_NAME", 
    ROUND(IFNULL(t.price*s.qty*t.royalty*0.01*ta.royaltyper*0.01,0),2) "ROYALTY",
    ROUND(IFNULL(t.advance*royalty*0.01*ta.royaltyper*0.01,0),2) "ADVANCE"
	FROM authors AS a
	LEFT JOIN titleauthor AS ta ON a.au_id=ta.au_id
	LEFT JOIN titles AS t ON ta.title_id=t.title_id
	LEFT JOIN sales AS s ON t.title_id=s.title_id
    GROUP BY a.au_id 
);

 * mysql+pymysql://root:***@localhost/publications
23 rows affected.
Returning data to local variable step1

In [3]:
display(step1)

[]

### Step 2

In [4]:
%%sql step2 <<

CREATE TEMPORARY TABLE IF NOT EXISTS STEP_2(
SELECT 
	st1.TITLE_ID,
    st1.AUTHOR_ID,
    SUM(st1.ROYALTY) AS "AGG_ROYALTY",
    SUM(st1.ADVANCE) AS "AGG_ADVANCE"
FROM STEP_1 AS st1
GROUP BY st1.TITLE_ID, st1.AUTHOR_ID
);

 * mysql+pymysql://root:***@localhost/publications
23 rows affected.
Returning data to local variable step2

In [5]:
display(step2)

[]

### Step 3

In [6]:
%%sql step3 <<

SELECT 
    st2.AUTHOR_ID,
    st2.AGG_ROYALTY+AGG_ADVANCE "PROFIT"
FROM STEP_2 AS st2
LEFT JOIN titles AS t ON st2.title_id=t.title_id
ORDER BY PROFIT DESC
LIMIT 3

 * mysql+pymysql://root:***@localhost/publications
3 rows affected.
Returning data to local variable step3

In [7]:
display(step3)

[('722-51-5454', Decimal('2713.46')),
 ('238-95-7766', Decimal('1230.16')),
 ('899-46-2035', Decimal('904.49'))]

## Challenge 2

### Step 1 & 2 & 3

In [8]:
%%sql challenge2 <<

WITH STEP_1 AS 
(
SELECT 
	t.title_id "TITLE_ID",
	a.au_id "AUTHOR_ID", 
    a.au_lname "LAST_NAME", 
    ROUND(IFNULL(t.price*s.qty*t.royalty*0.01*ta.royaltyper*0.01,0),2) "ROYALTY",
    ROUND(IFNULL(t.advance*royalty*0.01*ta.royaltyper*0.01,0),2) "ADVANCE"
	FROM authors AS a
	LEFT JOIN titleauthor AS ta ON a.au_id=ta.au_id
	LEFT JOIN titles AS t ON ta.title_id=t.title_id
	LEFT JOIN sales AS s ON t.title_id=s.title_id
    GROUP BY a.au_id 
),    
STEP_2 AS
(
SELECT 
	st1.TITLE_ID,
    st1.AUTHOR_ID,
    SUM(st1.ROYALTY) AS "AGG_ROYALTY",
    SUM(st1.ADVANCE) AS "AGG_ADVANCE"
FROM STEP_1 AS st1
GROUP BY st1.TITLE_ID, st1.AUTHOR_ID
)
SELECT 
    st2.AUTHOR_ID,
    st2.AGG_ROYALTY+AGG_ADVANCE "PROFIT"
FROM STEP_2 AS st2
LEFT JOIN titles AS t ON st2.title_id=t.title_id
ORDER BY PROFIT DESC
LIMIT 3

 * mysql+pymysql://root:***@localhost/publications
3 rows affected.
Returning data to local variable challenge2

In [9]:
display(challenge2)

[('722-51-5454', Decimal('2713.46')),
 ('238-95-7766', Decimal('1230.16')),
 ('899-46-2035', Decimal('904.49'))]

## Challenge 3

In [10]:
%%sql challenge3 <<

DROP TABLE IF EXISTS most_profiting_authors;

 * mysql+pymysql://root:***@localhost/publications
0 rows affected.
Returning data to local variable challenge3

In [11]:
%%sql challenge3 <<

CREATE TABLE IF NOT EXISTS most_profiting_authors(
SELECT 
    st2.AUTHOR_ID,
    st2.AGG_ROYALTY+AGG_ADVANCE "PROFIT"
FROM STEP_2 AS st2
LEFT JOIN titles AS t ON st2.title_id=t.title_id
ORDER BY PROFIT DESC
);

 * mysql+pymysql://root:***@localhost/publications
23 rows affected.
Returning data to local variable challenge3

In [12]:
%%sql table <<
SELECT*
FROM most_profiting_authors

 * mysql+pymysql://root:***@localhost/publications
23 rows affected.
Returning data to local variable table

In [13]:
display(table)

[('722-51-5454', Decimal('2713.46')),
 ('238-95-7766', Decimal('1230.16')),
 ('899-46-2035', Decimal('904.49')),
 ('807-91-6654', Decimal('783.80')),
 ('648-92-1872', Decimal('593.46')),
 ('756-30-7391', Decimal('557.39')),
 ('274-80-9391', Decimal('529.99')),
 ('427-17-2319', Decimal('450.00')),
 ('846-92-7186', Decimal('450.00')),
 ('672-71-3249', Decimal('331.99')),
 ('724-80-9391', Decimal('317.93')),
 ('409-56-7008', Decimal('306.00')),
 ('472-27-2349', Decimal('248.99')),
 ('172-32-1176', Decimal('229.99')),
 ('267-41-2394', Decimal('211.95')),
 ('213-46-8915', Decimal('204.00')),
 ('998-72-3567', Decimal('138.47')),
 ('712-45-1867', Decimal('23.99')),
 ('341-22-1782', Decimal('0.00')),
 ('486-29-1786', Decimal('0.00')),
 ('527-72-3246', Decimal('0.00')),
 ('724-08-9931', Decimal('0.00')),
 ('893-72-1158', Decimal('0.00'))]